{
  "backend/main.mo": "Defines the backend actor with user profiles, deposit/withdrawal requests, referral bonuses, earning plans, and related query functions.",
  "feature_evidence.json": "Feature evidence report linking implemented features to source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Empty stylesheet placeholder for global styles.",
  "frontend/index.html": "Basic HTML bootstrap file loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Sets up the app’s router structure and wraps all pages in AuthGate, AppLayout, and theming.",
  "frontend/src/components/admin/PendingDepositsTable.tsx": "Admin table for reviewing, approving, or rejecting pending deposit requests, including screenshot preview.",
  "frontend/src/components/admin/PendingWithdrawalsTable.tsx": "Admin table for reviewing, approving, or rejecting pending withdrawal requests.",
  "frontend/src/components/AdminGate.tsx": "Restricts access to admin-only areas, showing loading or denial UI when appropriate.",
  "frontend/src/components/AppHeader.tsx": "Top navigation header with responsive menus, page links, branding, and login button.",
  "frontend/src/components/AppLayout.tsx": "Defines the app’s page layout including header, content container, and footer.",
  "frontend/src/components/AuthGate.tsx": "Handles Internet Identity login flow and shows a login screen for unauthenticated users.",
  "frontend/src/components/CopyToClipboardButton.tsx": "Button that copies provided text to clipboard and shows success or error feedback.",
  "frontend/src/components/DepositRequestList.tsx": "Displays the user's deposit requests with status, amounts, and dates, including loading and empty states.",
  "frontend/src/components/FileUploadField.tsx": "File upload component with preview, clear functionality, and support for custom labels and accepted types.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button using Internet Identity with loading state and error handling.",
  "frontend/src/components/PlanCard.tsx": "Shows investment plan details including deposit, profit, duration, ROI, and optional child content.",
  "frontend/src/components/WithdrawalRequestList.tsx": "Displays the user's withdrawal requests with status, method, account info, and dates.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages the backend actor based on identity changes and refreshes dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, handling identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data such as plans, balances, user profiles, deposits, and withdrawals.",
  "frontend/src/index.css": "Tailwind CSS configuration defining global styles, theme variables, and dark mode color tokens.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AccountPage.tsx": "Displays and edits the user's profile, prompting setup if missing and saving updates via mutations.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard offering tabs to review pending deposit and withdrawal requests, gated behind an admin check.",
  "frontend/src/pages/DepositPage.tsx": "Allows users to select a plan, view deposit details, upload payment proof, and submit deposit requests.",
  "frontend/src/pages/PlansPage.tsx": "Shows a hero section and a list of available investment plans, linking users to the deposit workflow.",
  "frontend/src/pages/ReferralsPage.tsx": "Displays the referral dashboard showing the user's referral code, link, stats, and bonus tiers, with loading skeletons.",
  "frontend/src/pages/WalletPage.tsx": "Shows available balance, accrued earnings from the active plan, and details of the approved deposit, with loading states.",
  "frontend/src/pages/WithdrawalsPage.tsx": "Provides a form to submit withdrawal requests with validation, displays limits, and lists past withdrawal requests.",
  "frontend/src/utils/earnings.ts": "Computes accrued earnings based on start time, duration, and daily profit, returning dates, elapsed days, and totals.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, persisting, and clearing URL or session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme colors, fonts, container settings, and plugins such as typography and animations.",
  "project_state.json": "Defines the project state for the Earn app, including plan details, deposit/withdrawal rules, referral bonuses, required images, and implemented features. Contains configuration, architectural notes, and no known issues."
}