{
  "backend/main.mo": "Defines actor with access control, storage mixins, user profiles, investment plans, deposit/withdrawal request types, and various query endpoints.",
  "feature_evidence.json": "Feature evidence report linking UI external website link features to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing responsibilities of all frontend components, pages, hooks, and utilities.",
  "frontend/index.css": "Empty stylesheet placeholder for global styles.",
  "frontend/index.html": "Basic HTML entry file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Configures TanStack Router routes and wraps the app with ThemeProvider, AuthGate, and Toaster.",
  "frontend/src/components/admin/PendingDepositsTable.tsx": "Admin table listing pending deposit requests with screenshot viewing and approve/reject actions.",
  "frontend/src/components/admin/PendingWithdrawalsTable.tsx": "Admin table for pending withdrawal requests, showing user info and providing approve/reject controls.",
  "frontend/src/components/AdminGate.tsx": "Restricts access to admin-only pages, showing loading or access denied states when appropriate.",
  "frontend/src/components/AppHeader.tsx": "Renders top navigation with links, admin-aware menu items, mobile drawer, login button, and optional external website link.",
  "frontend/src/components/AppLayout.tsx": "Page layout wrapper providing header, main content area, and footer with optional external website link.",
  "frontend/src/components/AuthGate.tsx": "Blocks app content until user authenticates via Internet Identity, showing loading or login screen.",
  "frontend/src/components/CopyToClipboardButton.tsx": "Button that copies text to clipboard and shows temporary success feedback using toast notifications.",
  "frontend/src/components/DepositRequestList.tsx": "Displays the user's deposit requests with loading, empty, and table views, including status badges and formatted dates.",
  "frontend/src/components/FileUploadField.tsx": "Provides a file upload UI with preview, clear functionality, and support for selecting images via a hidden input.",
  "frontend/src/components/LoginButton.tsx": "Implements a login/logout button using Internet Identity with handling for authentication state and errors.",
  "frontend/src/components/PlanCard.tsx": "Renders a plan's financial details such as deposit, daily profit, duration, and ROI, with optional child components.",
  "frontend/src/components/WithdrawalRequestList.tsx": "Shows the user's withdrawal requests in a table with status, payout method, account info, and formatted dates.",
  "frontend/src/config/externalWebsite.ts": "Provides validated external website URL and label from environment variables, returning null if invalid.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including login, logout, and persisted identity loading. Wraps AuthClient creation and exposes identity state and status flags.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data such as plans, balances, profiles, deposits, and withdrawals. Uses useActor to call canister methods and auto‑invalidates relevant queries.",
  "frontend/src/index.css": "Tailwind setup defining global CSS variables for light and dark themes and applying base styles. Customizes color tokens and applies background and text defaults.",
  "frontend/src/main.tsx": "Initializes the React app, wrapping it with QueryClientProvider and InternetIdentityProvider. Renders App into the root element.",
  "frontend/src/pages/AccountPage.tsx": "Displays and edits the user's profile, prompting setup if missing and saving details via mutations. Shows profile info and uses identity to generate a referral code.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard with tabs for reviewing pending deposit and withdrawal requests.",
  "frontend/src/pages/DepositPage.tsx": "Allows users to select a plan, view deposit account details, upload a payment screenshot, and submit a deposit request. Handles form validation, file upload, and mutation submission.",
  "frontend/src/pages/PlansPage.tsx": "Shows a hero section and a list of available investment plans fetched from the backend. Provides navigation to the deposit page and displays PlanCard components.",
  "frontend/src/pages/ReferralsPage.tsx": "Displays referral code, link, stats, and bonus tiers using user profile and tier data with loading states.",
  "frontend/src/pages/WalletPage.tsx": "Shows available balance, accrued earnings, and active plan info using deposit and balance queries.",
  "frontend/src/pages/WithdrawalsPage.tsx": "Provides a form to submit withdrawal requests with validation, limits, and a list of past requests.",
  "frontend/src/utils/earnings.ts": "Calculates accrued earnings and elapsed days based on start time, duration, and daily profit.",
  "frontend/src/utils/urlParams.ts": "Utilities for getting, storing, and clearing URL and session-based parameters for routing and persistence.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom colors, typography, animations, and container settings.",
  "project_state.json": "Defines the project’s current state for the Earn app, including payment flows, earning plans, withdrawal rules, referral bonuses, and implemented features. Contains architecture notes, requirements, and existing feature versions."
}