{
  "kind": "build_request",
  "title": "Add configurable external website link to the Earn app navigation",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-10",
      "text": "Add a configurable external website link (URL + label) to the Earn app UI so users can click from the app to the user’s website.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "Link my website"
        ]
      },
      "acceptanceCriteria": [
        "A new external link is available in the primary navigation (desktop) and the mobile menu.",
        "The external link opens in a new tab and uses safe link attributes (e.g., rel=\"noopener noreferrer\").",
        "The external website URL and label are configurable in the frontend (e.g., via a single config module and/or Vite env vars such as VITE_WEBSITE_URL and VITE_WEBSITE_LABEL).",
        "If no website URL is configured, the external link is not rendered anywhere (no broken/placeholder link).",
        "All user-facing text for this feature is in English (e.g., default label: \"Website\")."
      ]
    },
    {
      "id": "REQ-11",
      "text": "Add the same configurable external website link to the global footer alongside the existing attribution link(s).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "Link my website"
        ]
      },
      "acceptanceCriteria": [
        "The footer displays a \"Website\" link only when a valid external URL is configured.",
        "Clicking the footer website link opens the configured URL in a new tab with rel=\"noopener noreferrer\".",
        "Footer layout remains responsive and visually consistent with the existing theme."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Do not add or require any third-party authentication or external backend services.",
    "Keep the backend unchanged (no Motoko/state changes) for this request unless strictly necessary."
  ],
  "nonGoals": [
    "Buying/configuring a custom domain, DNS records, or external hosting setup for the user’s website.",
    "Building or embedding the user’s external website inside the app (iframe-based embedding is out of scope).",
    "Changing existing earning plans, deposit/withdrawal flows, referral logic, or admin workflows."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}