{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Configurable external website link in navigation and footer",
  "requirements": [
    {
      "id": "REQ-10",
      "summary": "Add a configurable external website link (label + URL) to desktop primary navigation and the mobile menu, rendered only when configured and opened safely in a new tab.",
      "acceptanceCriteria": [
        "A new external link is available in the primary navigation (desktop) and the mobile menu.",
        "The external link opens in a new tab and uses safe link attributes (e.g., rel=\"noopener noreferrer\").",
        "The external website URL and label are configurable in the frontend (e.g., via a single config module and/or Vite env vars such as VITE_WEBSITE_URL and VITE_WEBSITE_LABEL).",
        "If no website URL is configured, the external link is not rendered anywhere (no broken/placeholder link).",
        "All user-facing text for this feature is in English (e.g., default label: \"Website\")."
      ],
      "file_operations": [
        {
          "path": "frontend/src/config/externalWebsite.ts",
          "operation": "create",
          "description": "Create a single configuration module that reads Vite env vars (VITE_WEBSITE_URL, VITE_WEBSITE_LABEL), applies an English default label (\"Website\"), and exposes a helper that returns a validated external link object only when the URL is present and safe (e.g., http/https); otherwise returns null."
        },
        {
          "path": "frontend/src/components/AppHeader.tsx",
          "operation": "modify",
          "description": "Wire the configurable external website link into both desktop navigation and the mobile menu using the shared config helper; render it as an external anchor that opens in a new tab with rel=\"noopener noreferrer\", and ensure it is not rendered anywhere when no valid URL is configured. Use existing shadcn-ui Button/Sheet patterns already present for consistent styling; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-11",
      "summary": "Add the same configurable external website link to the global footer next to existing attribution, shown only when configured and kept responsive.",
      "acceptanceCriteria": [
        "The footer displays a \"Website\" link only when a valid external URL is configured.",
        "Clicking the footer website link opens the configured URL in a new tab with rel=\"noopener noreferrer\".",
        "Footer layout remains responsive and visually consistent with the existing theme."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AppLayout.tsx",
          "operation": "modify",
          "description": "Import and use the shared external website config helper to conditionally render a \"Website\" footer link alongside the existing caffeine.ai attribution; ensure the link opens in a new tab with rel=\"noopener noreferrer\" and that the footer remains responsive and visually consistent (no placeholder when URL is missing)."
        }
      ]
    }
  ]
}